export const inputs = [
  {
    title: 'видовое название растения',
    name: 'title',
  }
];

export const selects = [
  {
    title: 'жизненная форма',
    name: 'lifeForm',
    values: [
      '-',
      'дерево',
      'кустарник',
      'кустарничек',
      'трава'
    ]
  },
  {
    title: 'класс',
    name: 'class',
    values: [
      '-',
      'однодольные',
      'двудольные'
    ]
  },
  {
    title: 'тип корневой системы',
    name: 'rootSystem',
    values: [
      '-',
      'cтержневая крн си',
      'мочковатая крн си',
      'подземные побеги'
    ]
  },
  {
    title: 'тип листьев',
    name: 'sheetType',
    values: [
      '-',
      'простой',
      'сидячий',
      'сложный'
    ]
  },
  {
    title: 'тип жилкования',
    name: 'vinationType',
    values: [
      '-',
      'сетчатый',
      'дуговой'
    ]
  },
  {
    title: 'тип цветка',
    name: 'flowerType',
    values: [
      '-',
      'одиночный',
      'соцветие'
    ]
  },
  {
    title: 'формула цветка, тип плода',
    name: 'fetusType',
    values: [
      '-',
      'Крестоцветные',
      'Розоцветные',
      'Бобовые',
      'Пасленовые',
      'Сложноцветные',
      'Лилейные',
      'Злаковые'
    ]
  },
  {
    title: 'тип распространения',
    name: 'distributeType',
    values: [
      '-',
      'Сухие',
      'Сочные'
    ]
  },
  {
    title: 'место произрастания',
    name: 'environmentType',
    values: [
      '-',
      'лес',
      'луг',
      'поле',
      'болото'
    ]
  },
  {
    title: 'применяемые человеком',
    name: 'environmentType',
    values: [
      '-',
      'пищевое',
      'лекарственное',
      'сорняк', 'кормовое',
      'медонос',
      'хлебные',
      'декоративное' 
    ]
  }
];
